Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: When a JSON extension is installed such as `quarkus-rest-client-jackson` or `quarkus-rest-client-jsonb`, Quarkus will use the `application/json` media type by default for most return values, unless the media type is explicitly set via `@Produces` or `@Consumes` annotations (there are some exceptions for well known types, such as `String` and `File`, which default to `text/plain` and `application/octet-stream` respectively).
ja_jp: `quarkus-rest-client-jackson` や `quarkus-rest-client-jsonb` などの JSON エクステンションがインストールされている場合、メディアタイプが `@Produces` や `@Consumes` アノテーションで明示的に設定されていない限り、Quarkus はほとんどの戻り値に `application/json` メディアタイプをデフォルトで使用します( `String` や `File` などのよく知られたタイプには例外があり、それぞれ `text/plain` と `application/octet-stream` がデフォルトとなっています)。

source: When a JSON extension is installed such as `quarkus-rest-jackson` or `quarkus-rest-jsonb`, Quarkus will use the `application/json` media type by default for most return values, unless the media type is explicitly set via `@Produces` or `@Consumes` annotations (there are some exceptions for well known types, such as `String` and `File`, which default to `text/plain` and `application/octet-stream` respectively).
ja_jp: `quarkus-rest-jackson` や `quarkus-rest-jsonb` などのJSONエクステンションがインストールされている場合、 メディアタイプが `@Produces` や `@Consumes` アノテーションで明示的に設定されていない限り、Quarkusはほとんどの返り値にデフォルトで `application/json` メディアタイプを使用します（よく知られている `String` や `File` などのタイプには例外があり、デフォルトはそれぞれ `text/plain` や `application/octet-stream` です）。

source: When a JSON extension is installed such as `quarkus-resteasy-client-jackson` or `quarkus-resteasy-client-jsonb`, Quarkus will use the `application/json` media type by default for most return values, unless the media type is explicitly set via `@Produces` or `@Consumes` annotations (there are some exceptions for well known types, such as `String` and `File`, which default to `text/plain` and `application/octet-stream` respectively).
ja_jp: `quarkus-resteasy-client-jackson` や `quarkus-resteasy-client-jsonb` などのJSONエクステンションがインストールされている場合、メディアタイプが `@Produces` や `@Consumes` アノテーションによって明示的に設定されていない限り、Quarkusはほとんどの返り値に対してデフォルトで `application/json` メディアタイプを使用します（よく知られているタイプについては、 `String` や `File` などの例外があり、デフォルトではそれぞれ `text/plain` や `application/octet-stream` になります）。

source: When a JSON extension is installed such as `quarkus-resteasy-jackson` or `quarkus-resteasy-jsonb`, Quarkus will use the `application/json` media type by default for most return values, unless the media type is explicitly set via `@Produces` or `@Consumes` annotations (there are some exceptions for well known types, such as `String` and `File`, which default to `text/plain` and `application/octet-stream` respectively).
ja_jp: `quarkus-resteasy-jackson` や `quarkus-resteasy-jsonb` などの JSON エクステンションがインストールされている場合、メディアタイプが `@Produces` や `@Consumes` アノテーションで明示的に設定されていない限り、Quarkus はほとんどの戻り値に `application/json` メディアタイプをデフォルトで使用します( `String` や `File` などのよく知られたタイプには例外があり、それぞれ `text/plain` と `application/octet-stream` がデフォルトとなっています)。

source: When a JSON extension is installed such as `quarkus-resteasy-reactive-jackson` or `quarkus-resteasy-reactive-jsonb`, Quarkus will use the `application/json` media type by default for most return values, unless the media type is explicitly set via `@Produces` or `@Consumes` annotations (there are some exceptions for well known types, such as `String` and `File`, which default to `text/plain` and `application/octet-stream` respectively).
ja_jp: `quarkus-resteasy-jackson` や `quarkus-resteasy-jsonb` などの JSON エクステンションがインストールされている場合、メディアタイプが `@Produces` や `@Consumes` アノテーションで明示的に設定されていない限り、Quarkus はほとんどの戻り値に `application/json` メディアタイプをデフォルトで使用します( `String` や `File` などのよく知られたタイプには例外があり、それぞれ `text/plain` と `application/octet-stream` がデフォルトとなっています)。

source: When a JSON extension like `quarkus-resteasy-jackson` or `quarkus-resteasy-jsonb` is installed, Quarkus defaults to the `application/json` media type for most return values. This can be overridden using `@Produces` or `@Consumes` annotations, except for certain well-known types like `String` (defaulting to `text/plain`) and `File` (defaulting to `application/octet-stream`).
ja_jp: `quarkus-resteasy-jackson` や `quarkus-resteasy-jsonb` などの JSON エクステンションがインストールされている場合、Quarkus はほとんどの戻り値に対して `application/json` メディアタイプをデフォルトとして使用します。 これは、`String` (デフォルトは `text/plain`) や `File` (デフォルトは `application/octet-stream`) などの特定のよく知られたタイプを除き、`@Produces` または `@Consumes` アノテーションを使用してオーバーライドできます。

source: When a Mongo Client is configured at build time, and its URL is set at runtime, it is active by default. Quarkus starts the corresponding Mongo Client when the application starts.
ja_jp: Mongo クライアントがビルド時に設定され、その URL が実行時に設定されている場合、デフォルトでアクティブになります。Quarkus はアプリケーションの起動時に対応する Mongo クライアントを起動します。

source: When a Quarkus application starts, a `ConfigSource` can be initialized twice. One time for _STATIC INIT_ and a second time for _RUNTIME INIT_:
ja_jp: Quarkusアプリケーションの起動時に、 `ConfigSource` を2回初期化することができます。1回目は _STATIC INIT_ で、2回目は _RUNTIME INIT_ です。

source: When a Quarkus application starts, a config mapping can be registered twice. One time for _STATIC INIT_ and a second time for _RUNTIME INIT_:
ja_jp: Quarkusアプリケーションの起動時に、コンフィグマッピングを2回登録することができます。1回は _STATIC INIT_用、2回目は _RUNTIME INIT_用です。

source: When a Quarkus project has Qute in the classpath, editing a Qute template (HTML / JSON / YAML / Text) will add new features into the editor.
ja_jp: QuarkusプロジェクトのクラスパスにQuteがある場合、Quteテンプレート（HTML / JSON / YAML / Text）の編集は、エディタに新機能を追加します。

source: When a REST Client does not use a config key (for example when it is created programmatically via `QuarkusRestClientBuilder`) then the class name can be used instead. For example:
ja_jp: REST クライアントが設定キーを使用しない場合 (たとえば、 `QuarkusRestClientBuilder` を介してプログラムで作成される場合など)、代わりにクラス名を使用できます。 以下に例を示します。

source: When a Reactive Messaging Message associated with a RabbitMQ Message is acknowledged, it informs the broker that the message has been _accepted_.
ja_jp: RabbitMQ メッセージに関連付けられたリアクティブメッセージングメッセージが確認されると、メッセージが _受け入れられた_ ことをブローカーに通知します。

source: When a Reactive Messaging Message associated with an AMQP Message is acknowledged, it informs the broker that the message has been http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted].
ja_jp: AMQP メッセージに関連付けられたリアクティブメッセージングメッセージが確認されると、そのメッセージが http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted] されたことをブローカーに通知します。

source: When a Reactive Messaging Message associated with an AMQP Message is acknowledged, it informs the broker that the message has been https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted].
ja_jp: AMQP メッセージに関連付けられたリアクティブメッセージングメッセージが確認されると、そのメッセージが https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted] されたことをブローカーに通知します。

source: When a Redis Clients is configured at build time, and its URL is set at runtime, it is active by default. Quarkus starts the corresponding Redis Client when the application starts.
ja_jp: Redis クライアントがビルド時に設定され、その URL が実行時に設定されている場合、デフォルトで有効になります。 Quarkus は、アプリケーションの起動時に対応する Redis クライアントを起動します。

source: When a Resource method needs to handle various types of multipart requests, then the `org.jboss.resteasy.reactive.server.multipart.MultipartFormDataInput` method type can be used as provides access to all the parts of the request.
ja_jp: Resourceメソッドが様々なタイプのマルチパートリクエストを処理する必要がある場合、リクエストのすべてのパートにアクセスできるように、 `org.jboss.resteasy.reactive.server.multipart.MultipartFormDataInput` メソッドタイプを使用することができます。

source: When a TLS connection is established, the handshake phase is the first step. During this phase, the client and server exchange information to establish the connection, which typically includes the cipher suite, the TLS protocol version, and the certification validation.
ja_jp: TLS 接続が確立されると、ハンドシェイクフェーズが最初のステップになります。 このフェーズでは、クライアントとサーバーは接続を確立するための情報 (通常は暗号スイート、TLS プロトコルバージョン、証明書の検証などが含まれる) を交換します。

source: When a `Uni` or `Multi` is returned from a method annotated with `@OnOpen`, `@OnTextMessage`, `@OnBinaryMessage`, or `@OnClose`, Quarkus subscribes to it automatically.
ja_jp: `@OnOpen`、 `@OnTextMessage`、 `@OnBinaryMessage`、または `@OnClose` アノテーションが付与されたメソッドから `Uni` または `Multi` が返されると、Quarkus はそれを自動的にサブスクライブします。

source: When a cache is accessed from the client, if the cache does not exist in the Infinispan Server and you want to create it on first access, use one of the following properties:
ja_jp: クライアントからキャッシュにアクセスする際、Infinispan サーバー内にキャッシュが存在せず、初回アクセス時にキャッシュを作成したい場合は、以下のいずれかのプロパティを使用します。

source: When a cache key is built from several method arguments, whether they are explicitly identified with `@CacheKey` or not, the building logic depends on the order of these arguments in the method signature. On the other hand, the arguments names are not used at all and do not have any effect on the cache key.
ja_jp: キャッシュキーが複数のメソッド引数から構築される場合、それらが明示的に `@CacheKey` で識別されているかどうかに関わらず、構築ロジックはメソッドシグネチャ内のこれらの引数の順序に依存します。一方、引数名は全く使用されず、キャッシュキーには何の影響も与えません。

source: When a client initiates a new TLS handshake, the server typically consumes significantly more CPU resources than the client. This resource asymmetry can be exploited to launch denial-of-service (DoS) attacks, overwhelming the server with renegotiation requests.
ja_jp: クライアントが新しい TLS ハンドシェイクを開始すると、通常、サーバーはクライアントよりも大幅に多くの CPU リソースを消費します。このリソースの非対称性は、サービス拒否 (DoS) 攻撃を開始するために悪用され、再ネゴシエーションリクエストでサーバーを圧倒する可能性があります。

source: When a client secret is configured with `quarkus.oidc.credentials.secret`, it is sent alongside `quarkus.oidc.client-id` as an HTTP `Authorization: Basic` credentials pair. However, some providers can only accept the client id and secret if they are sent as POST form parameters, when you need to use the `quarkus.oidc.credentials.client-secret.method=post` configuration.
ja_jp: クライアントシークレットが `quarkus.oidc.credentials.secret` で設定されている場合、 `quarkus.oidc.client-id` と共に HTTP `Authorization: Basic` クレデンシャルペアとして送信されます。しかし、プロバイダーによっては、クライアント ID とシークレットが POST フォームパラメーターとして送信された場合にのみ受け入れることができ、その場合は `quarkus.oidc.credentials.client-secret.method=post` 設定を使用する必要があります。

source: When a client sends a HTTP request, Quarkus Security orchestrates security authentication and authorization by interacting with several built-in core components, including `HttpAuthenticationMechanism`, `IdentityProvider`, and `SecurityIdentityAugmentor`.
ja_jp: クライアントがHTTPリクエストを送信すると、Quarkus Securityは、 `HttpAuthenticationMechanism` 、 `IdentityProvider` 、 `SecurityIdentityAugmentor` などの複数の組み込みコアコンポーネントと相互作用することによって、セキュリティ認証と認可をオーケストレートします。

source: When a client sends an HTTP request, Quarkus Security orchestrates security authentication and authorization by interacting with several built-in core components including `HttpAuthenticationMechanism`, `IdentityProvider`, and `SecurityIdentityAugmentor`.
ja_jp: クライアントがHTTPリクエストを送信すると、Quarkus Securityは、 `HttpAuthenticationMechanism` 、 `IdentityProvider` 、 `SecurityIdentityAugmentor` などの複数の組み込みコアコンポーネントと対話しながら、セキュリティ認証と認可をオーケストレーションします。

source: When a client sends an HTTP request, Quarkus Security orchestrates security authentication and authorization by interacting with several built-in core components, including `HttpAuthenticationMechanism`, `IdentityProvider`, and `SecurityIdentityAugmentor`.
ja_jp: クライアントがHTTPリクエストを送信すると、Quarkus Securityは、 `HttpAuthenticationMechanism` 、 `IdentityProvider` 、 `SecurityIdentityAugmentor` などのいくつかの組み込みコアコンポーネントと相互作用することによって、セキュリティ認証と認可をオーケストレートします。

source: When a client such as Single-page application (SPA) receives a challenge with the `insufficient_user_authentication` error code, it must parse `acr_values`, request a new user login which must meet the `acr_values` constraints, and use a new access token to access Quarkus.
ja_jp: シングルページアプリケーション (SPA) などのクライアントが `insufficient_user_authentication` エラーコードを含むチャレンジを受け取った場合、 `acr_values` を解析し、 `acr_values` の制約を満たす新しいユーザーログインを要求し、新しいアクセストークンを使用して Quarkus にアクセスする必要があります。

source: When a current tenant represents an OIDC `web-app` application, the current `io.vertx.ext.web.RoutingContext` contains a `tenant-id` attribute by the time the custom tenant resolver has been called for all the requests completing the code authentication flow and the already authenticated requests, when either a tenant-specific state or session cookie already exists. Therefore, when working with multiple OIDC providers, you only need a path-specific check to resolve a tenant id if the `RoutingContext` does not have the `tenant-id` attribute set, for example:
ja_jp: 現在のテナントが OIDC の `web-app` アプリケーションを表す場合、カスタムテナントリゾルバーがすべてのリクエストに対して呼び出されるまでに、現在の `io.vertx.ext.web.RoutingContext` には `tenant-id` 属性が含まれ、テナント固有の状態またはセッション Cookie のいずれかがすでに存在する場合に、コード認証フローとすでに認証されたリクエストを完了します。 したがって、複数の OIDC プロバイダーを使用する場合、`RoutingContext` に `tenant-id` 属性が設定されていない場合にのみ、パス固有のチェックを行ってテナント ID を解決する必要があります。以下はその例です。

source: When a current tenant represents an OIDC `web-app` application, the current `io.vertx.ext.web.RoutingContext` will contain a `tenant-id` attribute by the time the custom tenant resolver has been called for all the requests completing the code authentication flow and the already authenticated requests, when either a tenant specific state or session cookie already exists. Therefore, when working with multiple OpenID Connect Providers, you only need a path specific check to resolve a tenant id if the `RoutingContext` does not have the `tenant-id` attribute set, for example:
ja_jp: 現在のテナントが OIDC の `web-app` アプリケーションを表す場合、カスタムテナントリゾルバーがすべてのリクエストに対して呼び出されるまでに、現在の `io.vertx.ext.web.RoutingContext` には `tenant-id` 属性が含まれ、テナント固有の状態またはセッション Cookie のいずれかがすでに存在する場合に、コード認証フローとすでに認証されたリクエストを完了します。したがって、複数の OpenID Connect プロバイダーを使用する場合、 `RoutingContext` に `tenant-id` 属性が設定されていない場合にのみ、パス固有のチェックを行ってテナント ID を解決する必要があります。以下はその例です。

source: When a datasource is configured at build time, and its URL is set at runtime, it is active by default. Quarkus starts the corresponding JDBC connection pool or reactive client when the application starts.
ja_jp: データソースがビルド時に設定され、そのURLが実行時に設定されると、デフォルトでアクティブになります。 Quarkusでは、アプリケーションの起動時に、対応するJDBC接続プールまたはリアクティブクライアントが起動します。

source: When a datasource is configured for XA transactions by setting `quarkus.datasource[.optional name].jdbc.transactions=xa` and the transaction recovery system is enabled by using `quarkus.transaction-manager.enable-recovery=true`, the datasource is automatically registered for recovery. This is the preferred and safe default. You can override this behavior for individual datasources by setting `quarkus.datasource.jdbc.enable-recovery=false` or `quarkus.datasource."datasource-name".jdbc.enable-recovery=false`.
ja_jp: `quarkus.datasource[.optional name].jdbc.transactions=xa` を設定してデータソースが XA トランザクション用に設定され、 `quarkus.transaction-manager.enable-recovery=true` を使用してトランザクションリカバリーシステムが有効になっている場合、データソースは自動的にリカバリー対象として登録されます。 これは推奨される安全なデフォルトです。 `quarkus.datasource.jdbc.enable-recovery=false` または `quarkus.datasource."datasource-name".jdbc.enable-recovery=false` を設定することで、個別のデータソースに対してこの動作をオーバーライドできます。

source: When a deserialization failure occurs, you can intercept it and provide a failure strategy. To achieve this, you need to create a bean implementing `DeserializationFailureHandler<T>` interface:
ja_jp: デシリアライゼーションがエラーが発生したとき、それをインターセプトしてエラーストラテジーを提供することができます。 これを実現するには、 `DeserializationFailureHandler<T>` インターフェイスを実装した Bean を作成する必要があります。

source: When a dev mode session or test suite execution ends, Quarkus will (by default) stop Elasticsearch Dev Services.
ja_jp: 開発モードのセッションまたはテストスイートの実行が終了すると、 Quarkus は (デフォルトで) Elasticsearch Dev Services を停止します。

source: When a dev mode session or test suite execution ends, Quarkus will (by default) stop all database Dev Services.
ja_jp: 開発モードのセッションまたはテストスイートの実行が終了すると、 Quarkusは（デフォルトで）すべてのデータベースDev Servicesを停止します。

source: When a file needs to be returned, the following code ensures that Quarkus properly streams the file contents to the client.
ja_jp: ファイルを返す必要がある場合、以下のコードにより Quarkus はファイルの内容をクライアントに適切にストリーミングします。

source: When a match is found, the extension will:
ja_jp: 一致が見つかると、エクステンションは次のように動作します。

source: When a message produced from a Kafka record is acknowledged, the connector invokes a commit strategy. These strategies decide when the consumer offset for a specific topic/partition is committed. Committing an offset indicates that all previous records have been processed. It is also the position where the application would restart the processing after a crash recovery or a restart.
ja_jp: Kafka レコードから生成されたメッセージが確認応答されると、コネクターはコミットストラテジーを呼び出します。これらのストラテジーは、特定のトピック/パーティションのコンシューマーオフセットがいつコミットされるかを決定します。オフセットをコミットすると、以前のすべてのレコードが処理されたことを示します。また、これは、クラッシュリカバリーまたは再起動後にアプリケーションが処理を再開する位置でもあります。

source: When a message produced from a Pulsar Message is *acknowledged*, the connector sends an https://pulsar.apache.org/docs/3.0.x/concepts-messaging/#acknowledgment[acknowledgement request] to the Pulsar broker. All Reactive Messaging messages need to be *acknowledged*, which is handled automatically in most cases. Acknowledgement requests can be sent to the Pulsar broker using the following two strategies:
ja_jp: Pulsar メッセージから生成されたメッセージが *確認応答* されると、コネクターが https://pulsar.apache.org/docs/3.0.x/concepts-messaging/#acknowledgment[確認応答リクエスト] を Pulsar ブローカーに送信します。 すべての Reactive Messaging メッセージが *確認応答* される必要があります。ほとんどの場合、これは自動的に処理されます。 確認応答リクエストは、次の 2 つのストラテジーを使用して Pulsar ブローカーに送信できます。

source: When a method annotated with `@CacheInvalidateAll` is invoked, Infinispan will remove all entries from the cache.
ja_jp: `@CacheInvalidateAll` でアノテーションされたメソッドが呼び出されると、Infinispan はキャッシュからすべてのエントリを削除します。

source: When a method annotated with `@CacheInvalidateAll` is invoked, Quarkus will remove all entries from the cache.
ja_jp: `@CacheInvalidateAll` でアノテーションされたメソッドが呼び出されると、Quarkusはキャッシュからすべてのエントリーを削除します。

source: When a method annotated with `@CacheInvalidate` is invoked, Infinispan will use the method argument as a cache key to try to remove an existing entry from the cache. If the key does not identify any cache entry, nothing will happen.
ja_jp: `@CacheInvalidate` でアノテーションされたメソッドが呼び出されると、 Infinispan はメソッドの引数をキャッシュキーとして使用し、 キャッシュから既存のエントリを削除しようとします。キーがキャッシュエントリーを特定できない場合、何も起こりません。

source: When a method annotated with `@CacheInvalidate` is invoked, Quarkus will compute a cache key and use it to try to remove an existing entry from the cache. If the method has one or more arguments, the key computation is done from all the method arguments if none of them is annotated with `@CacheKey`, or all the arguments annotated with `@CacheKey` otherwise. This annotation can also be used on a method with no arguments, a default key derived from the cache name is used in that case. If the key does not identify any cache entry, nothing will happen.
ja_jp: `@CacheInvalidate` でアノテーションされたメソッドが呼び出されると、Quarkusはキャッシュキーを計算し、それを使用してキャッシュから既存のエントリーを削除しようとします。メソッドに1つ以上の引数がある場合、キーの計算は、 `@CacheKey` でアノテーションされていない場合はすべてのメソッド引数から、そうでない場合は `@CacheKey` でアノテーションされているすべての引数から行われます。このアノテーションは引数を持たないメソッドでも使用でき、その場合はキャッシュ名から派生したデフォルトのキーが使用されます。キーがキャッシュエントリーを識別しない場合は、何も起こりません。

source: When a method annotated with `@CacheInvalidate` is invoked, Quarkus will compute a cache key and use it to try to remove an existing entry from the cache. See the <<cache-keys-building-logic>> section of this guide to learn how the cache key is computed. If the key does not identify any cache entry, nothing will happen.
ja_jp: `@CacheInvalidate` のアノテーションが付いたメソッドが呼び出されると、Quarkus はキャッシュキーを計算し、それを使ってキャッシュから既存のエントリを削除しようとします。 キャッシュキーの計算方法については、このガイドの <<cache-keys-building-logic>> のセクションを参照してください。 もしキーがどのキャッシュエントリも特定できない場合は、何も起こりません。

source: When a method annotated with `@CacheInvalidate` is invoked, Quarkus will compute a cache key and use it to try to remove an existing entry from the cache. See the xref:cache-keys-building-logic[Cache keys building logic] section of this guide to learn how the cache key is computed. If the key does not identify any cache entry, nothing will happen.
ja_jp: `@CacheInvalidate` でアノテーションされたメソッドが呼び出されると、Quarkusはキャッシュキーを計算し、それを使用してキャッシュから既存のエントリーを削除しようとします。キャッシュキーの計算方法については、このガイドの xref:cache-keys-building-logic[キャッシュキー構築ロジック] セクションを参照してください。キーがどのキャッシュ・エントリも識別しない場合、何も起こりません。

source: When a method annotated with `@CacheResult` is invoked, Quarkus will compute a cache key and use it to check in the cache whether the method has been already invoked. If the method has one or more arguments, the key computation is done from all the method arguments if none of them is annotated with `@CacheKey`, or all the arguments annotated with `@CacheKey` otherwise. Each non-primitive method argument that is part of the key must implement `equals()` and `hashCode()` correctly for the cache to work as expected. This annotation can also be used on a method with no arguments, a default key derived from the cache name is used in that case. If a value is found in the cache, it is returned and the annotated method is never actually executed. If no value is found, the annotated method is invoked and the returned value is stored in the cache using the computed key.
ja_jp: `@CacheResult` でアノテーションされたメソッドが呼び出されると、Quarkusはキャッシュキーを計算し、それを使用して、そのメソッドがすでに呼び出されているかどうかをキャッシュでチェックします。メソッドに1つ以上の引数がある場合、キーの計算は、 `@CacheKey` でアノテーションされていない場合はすべてのメソッド引数から、そうでない場合は `@CacheKey` でアノテーションされているすべての引数から行われます。キャッシュが期待通りに動作するためには、キーの一部である非プリミティブなメソッドの各引数は `equals()` と `hashCode()` を正しく実装しなければなりません。このアノテーションは引数を持たないメソッドにも使用することができ、その場合はキャッシュ名から派生したデフォルトキーが使用されます。キャッシュ内に値が見つかった場合はそれが返され、アノテーションされたメソッドは実際には実行されません。値が見つからない場合は、アノテーションされたメソッドが呼び出され、返された値は計算されたキーを使用してキャッシュに保存されます。

source: When a method annotated with `@CacheResult` is invoked, Quarkus will compute a cache key and use it to check in the cache whether the method has been already invoked. See the <<cache-keys-building-logic>> section of this guide to learn how the cache key is computed. If a value is found in the cache, it is returned and the annotated method is never actually executed. If no value is found, the annotated method is invoked and the returned value is stored in the cache using the computed key.
ja_jp: `@CacheResult` でアノテーションされたメソッドが呼び出されると、Quarkusはキャッシュキーを計算し、それを使用して、そのメソッドがすでに呼び出されているかどうかをキャッシュでチェックします。キャッシュキーの計算方法については、このガイドの <<cache-keys-building-logic>> のセクションを参照してください。 キャッシュ内に値が見つかった場合、その値が返され、アノテーションされたメソッドが実際に実行されることはありません。 値が見つからない場合、アノテーションされたメソッドが呼び出され、返された値は計算されたキーを使用してキャッシュに格納されます。

source: When a method annotated with `@CacheResult` is invoked, Quarkus will compute a cache key and use it to check in the cache whether the method has been already invoked. See the <<cache-keys-building-logic>> section of this guide to learn how the cache key is computed. If a value is found in the cache, it is returned, and the annotated method is never actually executed. If no value is found, the annotated method is invoked, and the returned value is stored in the cache using the computed key.
ja_jp: `@CacheResult` アノテーションが付けられたメソッドが呼び出されると、Quarkus はキャッシュキーを計算し、それを使用してそのメソッドがすでに呼び出されているかどうかをキャッシュで確認します。キャッシュキーがどのように計算されるかについては、このガイドの <<cache-keys-building-logic>> セクションを参照してください。キャッシュに値が見つかった場合、それが返され、アノテーションされたメソッドは実際には実行されません。値が見つからなかった場合、アノテーションされたメソッドが呼び出され、返された値は計算されたキーを使用してキャッシュに保存されます。
